// число > 0 - кирпич и его хп
// 0 - пустая клетка
// -1 - неразрушимая стена
// -2 - куст
// -3 - вода
// -4 - орёл

// Для каждого танка массив, в котором 8 чисел - номер столбца; номер строки; направление - 0, 1, 2, 3 - верх, право, низ, лево; количество здоровья;
// есть ли пуля (0, 1); номер столбца; номер строки; направление

// Счёт: 1 единица урона - +100 очков, 1 убитый танк - +250 очков, 1 пройденный уровень - +1000 очков

export const level1Objects = [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [7, 0, -1, 0, -1, 0, -1, 0, 0, 0], [-2, 0, -1, -1, -1, 0, -1, 0, 7, 7], 
[0, 0, -1, 0, -1, 0, -1, 0, 0, 0], [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], [0, 0, 0, 0, 0, 0, 0, -2, -2, -2],
[0, -3, -3, -2, -1, -3, 0, -2, -2, -2], [1, -3, -2, 6, 6, 6, 0, 0, 5, 4], [0, -2, -2, 0, 0, 0, 0, -3, 4, -4]];
export const level1PlayerTank = [[0, 45, 0, 1, 0, -1, -1, -1]];
export const level1EnemyTanks = [[0, 0, 0, 3, 0, -1, -1, -1], [40, 0, 0, 2, 0, -1, -1, -1], [45, 0, 0, 2, 0, -1, -1, -1]];

export const level2Objects = [[0, 0, 0, -3, -1, 0, 0, -2, 0, 0], [1, 2, 4, 0, 2, 2, 2, -2, -2, 2], [1, -3, 2, 0, 2, 2, 2, 4, 4, -3],
[1, -3, -2, -2, 0, -1, 0, 0, 0, 0], [1, -3, 0, 0, 4, 2, 0, 8, 8, 0], [0, -3, -1, 0, 4, 10, 3, 2, 2, 3], [0, 0, 0, 0, 0, 0, -2, 0, -3, 0],
[1, 0, -2, -2, -2, -2, 0, 0, -3, 0], [1, -1, -2, 3, 3, 3, 4, 0, 0, 0], [1, 0, -2, 3, -4, 3, 0, 0, -1, 0]];
export const level2PlayerTank = [[5, 45, 1, 1, 0, -1, -1, -1]];
export const level2EnemyTanks = [[5, 0, 1, 3, 0, -1, -1, -1], [25, 0, 2, 2, 0, -1, -1, -1], [45, 0, 3, 3, 0, -1, -1, -1]];

export const level3Objects = [[3, 0, 4, 0, -3, 0, -2, 0, -1, 0], [0, 4, 0, -3, 0, -2, 0, -1, 0, 3], [-3, 0, -2, 0, -1, 0, 3, 0, 4, 0], 
[0, -2, 0, -1, 0, 3, 0, 4, 0, -3], [-1, 0, 3, 0, 4, 0, -3, 0, -2, 0], [0, 3, 0, 4, 0, -3, 0, -2, 0, -1], [4, 0, -3, 0, -2, 0, -1, 0, 3, 0], 
[0, -3, 0, -2, 0, -1, -4, 3, 0, 4], [-2, 0, -1, 0, 3, 0, 4, 0, -3, 0], [0, -1, 0, 3, 0, 4, 0, -3, 0, -2]];
export const level3PlayerTank = [[20, 25, 0, 1, 0, -1, -1, -1]];
export const level3EnemyTanks = [[5, 0, 0, 1, 0, -1, -1, -1], [20, 5, 0, 1, 0, -1, -1, -1], [45, 0, 0, 1, 0, -1, -1, -1], [5, 20, 0, 1, 0, -1, -1, -1], 
[35, 20, 0, 1, 0, -1, -1, -1], [45, 20, 0, 1, 0, -1, -1, -1], [0, 35, 0, 1, 0, -1, -1, -1], [10, 45, 0, 1, 0, -1, -1, -1]];

export const level4Objects = [[0, 0, 0, 0, 0, 0, 0, -3, 0, 0], [0, 1, 1, 0, 2, 2, 0, 0, 0, 0], [0, 1, 1, 0, 2, 2, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, -1], [-1, 3, 0, -1, 0, 3, -1, -1, -2, -2], [0, 3, 0, 0, 0, 3, 0, -3, -1, -2], [0, 3, 3, 3, 3, 3, 0, -1, -2, -2], 
[0, 0, 0, 0, 0, -1, -1, -1, 0, 2], [2, 2, 0, 0, 0, -1, -4, -1, 0, 2], [0, 2, 0, 0, 0, -1, 0, 0, 0, 2]];
export const level4PlayerTank = [[15, 40, 3, 1, 0, -1, -1, -1]];
export const level4EnemyTanks = [[0, 45, 0, 3, 0, -1, -1, -1], [30, 0, 3, 3, 0, -1, -1, -1], [40, 0, 1, 2, 0, -1, -1, -1]];

export const level5Objects = [[-2, 0, -2, -3, -2, 0, -2, 0, -2, 0], [0, 0, 3, 0, 3, 0, 0, 0, 0, 0, -2], [-2, 0, -1, 0, 0, 0, 0, -1, 0, 0], 
[0, 0, -2, -2, -2, -2, -2, 0, 3, -2], [-2, 3, -2, -1, 6, -1, -2, 0, 0, -3], [-1, 0, -2, 6, -4, 6, -2, 0, 0, -2], [-2, 0, -2, -1, 6, -1, -2, 0, 0, 0], 
[0, 0, -2, -2, -2, -2, -2, 52, 0, -2], [-2, 0, 0, 0, 0, 0, 0, 0, 0, 0], [0, -2, 0, -2, -1, -2, 0, -2, 0, -2]];
export const level5PlayerTank = [[0, 45, 2, 1, 0, -1, -1, -1]];
export const level5EnemyTanks = [[5, 0, 1, 4, 0, -1, -1, -1], [45, 0, 3, 3, 0, -1, -1, -1], [30, 45, 2, 3, 0, -1, -1, -1]];

export function getLevelNeedDamage(levelEnemyTanks) {
    let ans = 0;
    for (let i = 0; i < levelEnemyTanks.length; ++i) {
        ans += levelEnemyTanks[i][3];
    }
    return ans;
}

export function getScore(previousLevelsScore, levelNeedDamage, levelEnemyTanks) {
    let hp = 0;
    let ans = 0;
    for (let i = 0; i < levelEnemyTanks.length; ++i) {
        hp += levelEnemyTanks[i][3];
        if (levelEnemyTanks[i][3] == 0) {
            ans += 250;
        }
    }
    ans += 100 * (levelNeedDamage - hp);
    return previousLevelsScore + ans;
}
